Documents/Renault_ИзменениеСкидокНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ИзменениеСкидокНаАвтомобили</Name>
			<Comment>Изменение скидок на автомобили (Renault)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеАвтомобилей</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_СкидкиНаАвтомобили</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидки</Name>
					<Comment>Устанавливаемый тип цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили цены которых надо изменить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Comment>Автомобиль</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации модели</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Comment>Новая цена автомобиля или модели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусАвтомобиля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_СтатусыАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПТС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсутствиеКлиента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_СкидкиНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СкидкиНаАвтомобили</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсутствиеКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Истина - вести учет в в валюте учета номенклатуры, Ложь - в валюте типа цены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Истина - цена включает НДС, ложь - цена НДС не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабот</Name>
					<Comment>Тип цен используется для работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТоваров</Name>
					<Comment>Тип цен используется для товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтомобилей</Name>
					<Comment>Тип цен используется для автомобилей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТипыЦенПоиска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Renault_ИзменениеСкидокНаАвтомобили/Ext/ObjectModule.bsl
// Модуль документа

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ

Перем ТекущаяВалютаДокумента Экспорт;
Перем ТекущийКурсДокумента Экспорт;
Перем ФормаОткрыта Экспорт;			//Добавил Шульц

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("Автомобиль",3);
	ОбязательныеАвтомобили.Вставить("ВариантКомплектации",2);
	ОбязательныеАвтомобили.Вставить("Цена",1);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
//	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
//	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
//	
//	// проверять на корректность реквизитов по организации будем только в случае если все нормально с остальными рекизитами
//	//Чтение значения для определения способа ведения баланса
//	СпособВеденияБаланса = Константы.СпособВеденияБаланса.Получить();
//	
//	// способ ведения не по организации или не прошла предыдущая проверка то и проверять ничего не будем
//	Если  Результат и СпособВеденияБаланса = Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
//		КонтролируемыеРеквизиты = Новый Структура();
//	
//		Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
//	КонецЕсли;	

//	Возврат Результат
//КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ИзменениеСкидокНаАвтомобили","Изменение скидок на автомобили",Истина);

	Возврат СписокХозОпераций;
КонецФункции

//Заполнения базового типа цен в зависимости от источника базовых цен
Процедура ЗаполнитьБазовуюЦену(СтрокаАвтомобилей) Экспорт
КонецПроцедуры

//Заполнения базового типа цен в зависимости от источника базовых цен
Процедура ЗаполнитьБазовыеЦены() Экспорт
КонецПроцедуры

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Результат=Истина;
	
	Если Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для каждого СтрокаТЧ Из Автомобили Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Результат=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Результат;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Результат;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" ИЛИ Имя="Автомобили.ВариантКомплектации" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда Возврат Ложь; КонецЕсли;
		Если ТипЗнч(ТекСтрока.Автомобиль)=Тип("СправочникСсылка.Автомобили") Тогда
			ТекСтрока.ВариантКомплектации=Неопределено;
		ИначеЕсли ТипЗнч(ТекСтрока.Автомобиль)=Тип("СправочникСсылка.Модели") И
			(НЕ обЗначениеНеЗаполнено(ТекСтрока.ВариантКомплектации)) И
			(ТекСтрока.ВариантКомплектации.Владелец<>ТекСтрока.Автомобиль) Тогда
			ТекСтрока.ВариантКомплектации=Неопределено;
		КонецЕсли; 
		////получим базовую цену
		//ЗаполнитьБазовуюЦену(ТекСтрока);
		//Если ПроцентНаценки<>0 Тогда
		//	ТекСтрока.ПроцентНаценки = ПроцентНаценки;
		//Иначе
		//	ТекСтрока.ПроцентНаценки = БазовыйТипЦен.ПроцентСкидкиНаценки;
		//КонецЕсли;
		//ТекСтрока.Цена = ТекСтрока.ЦенаБазовая+((ТекСтрока.ЦенаБазовая*ТекСтрока.ПроцентНаценки)/100);
		//Возврат Истина;
		//
	ИначеЕсли Имя="Автомобили.Цена" Тогда	
		Если ТекСтрока.ЦенаБазовая>0 Тогда 
			ТекСтрока.ПроцентНаценки=?(ТекСтрока.ЦенаБазовая=0,0,((ТекСтрока.Цена-ТекСтрока.ЦенаБазовая)/ТекСтрока.ЦенаБазовая)*100);
		КонецЕсли;
		Возврат Истина;

	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда

// Формирует печатную форму "ИзменениеЦенАвтомобилей"
// Возвращает сформированный табличный документ:
Функция ПечатьИзменениеЦенАвтомобилей(ТабДокумент) Экспорт
	//Макет = ПолучитьМакет("ИзменениеЦенАвтомобилей");
	//
	//МассивАвтомобилей = Автомобили.ВыгрузитьКолонку("Автомобиль");
	//ТипАвтомобиль = Тип("СправочникСсылка.Автомобили");
	//ЕстьАвтомобили = Ложь;
	//Для Каждого СтрокаАвтомобиль Из МассивАвтомобилей Цикл
	//	ЕстьАвтомобили = ТипЗнч(СтрокаАвтомобиль)=ТипАвтомобиль;
	//	Если ЕстьАвтомобили Тогда
	//		Прервать;			
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если НЕ ЕстьАвтомобили Тогда
	//	ОбластьАвтомобиль = Макет.Область("Товар");
	//	ОбластьVIN = Макет.Область("VIN");
	//	ОбластьАвтомобиль.ШиринаКолонки = ОбластьАвтомобиль.ШиринаКолонки + ОбластьVIN.ШиринаКолонки;
	//	Макет.УдалитьОбласть(ОбластьVIN,ТипСмещенияТабличногоДокумента.ПоВертикали);
	//КонецЕсли;
	//
	////для начала настроим макет
	//ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	//
	//ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права);
	//
	////вывод заголовка документа
	//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	//ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//ОбластьМакета.Параметры.ПредставлениеОрганизации	= спПолучитьПредставление(Организация);
	//ОбластьМакета.Параметры.ПредставлениеТипаЦен		= спПолучитьНаименование(ТипЦен);
	//
	////вывод свойств
	//СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	//ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	//ТабДокумент.Вывести(ОбластьМакета);
	//
	//НомерСтраницы = 2;
	//НомерСтраницыПред = НомерСтраницы;
	//
	////теперь выводим шапку
	//ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	//
	////готовим области строки
	//ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//
	//ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	//
	////заполним параметры шапки таблицы для следующего листа
	//ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	
	////перебор строк
	//ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();	
	//Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
	//	//заполняем данные строки
	//	СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,Права);
	//	// найдём старую цену
	//	СтруктураОтбора=Новый Структура("ТипЦен,Автомобиль,ВариантКомплектации",ТипЦен,СтрокаТабличнойЧасти.Автомобиль,СтрокаТабличнойЧасти.ВариантКомплектации);
	//	МоментВремени=?(Ссылка.Пустая(),Новый МоментВремени(КонецДня(Дата)),Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Исключая));
	//	СтрукрураЦен=РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(МоментВремени,СтруктураОтбора);
	//	ЦенаСтарая=СтрукрураЦен.Цена;
	//	
	//	ВалютаТипаЦены = обВалютаТипаЦены(СтрокаТабличнойЧасти.Автомобиль, ТипЦен);
	//	Если Не ВалютаТипаЦены = ВалютаДокумента Тогда
	//		ЦенаСтарая=обПересчет(ЦенаСтарая,ВалютаТипаЦены,Дата,ВалютаДокумента,КурсДокумента);	
	//	КонецЕсли;
	//	СтруктураСтроки.Вставить("ЦенаСтарая",Формат(ЦенаСтарая,ФорматВыводаСуммы));
	//	Если ТипЗнч(СтрокаТабличнойЧасти.Автомобиль)=ТипАвтомобиль Тогда
	//		СтруктураСтроки.Вставить("ВариантКомплектации",СтрокаТабличнойЧасти.Автомобиль.ВариантКомплектации);								
	//	Иначе 	
	//		СтруктураСтроки.Вставить("ВариантКомплектации",СтрокаТабличнойЧасти.ВариантКомплектации);
	//		Если ЕстьАвтомобили Тогда ОбластьМакета.Параметры.VIN = "";	КонецЕсли;
	//	КонецЕсли;
	//	
	//	ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
	//	
	//	//выводим строку, делая проверку попадания на лист
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы,,Права);
	//	
	//	//инициализация итогов по странице
	//	Если НомерСтраницы <> НомерСтраницыПред Тогда
	//		НомерСтраницыПред = НомерСтраницы;
	//		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	КонецЕсли;
	//КонецЦикла;

	////итоги
	//ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество();
	//
	//// Выводим представления и расшифровки подписей
	//ПредседательКомиссии = дкОтветственноеЛицо(ЭтотОбъект,"ПредседательКомиссии");
	//ПредседательКомиссии.ПредседательКомиссииПредставление = ?(обЗначениеНеЗаполнено(ПредседательКомиссии.ПредседательКомиссии),"","/ "+ ПредседательКомиссии.ПредседательКомиссииПредставление);
	//ОбластьМакета.Параметры.Заполнить(ПредседательКомиссии);
	//ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	//ГлавныйБухгалтер.ГлавныйБухгалтерПредставление = ?(обЗначениеНеЗаполнено(ГлавныйБухгалтер.ГлавныйБухгалтер),"","/ "+ ГлавныйБухгалтер.ГлавныйБухгалтерПредставление);
	//ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
	//
	//НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,Права);
	//
	//Возврат ТабДокумент;
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Возвращает доступные варианты печати документа
// Вовращаемое значение: Струткура, каждая строка которой
// соответствует одному из вариантов печати
// Рервый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("ИзменениеЦенАвтомобилей", "Изменение цен на автомобили");
   	Возврат СтруктураМакетов;
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ОкруглятьДо=1.00;
	КонецЕсли; 
	
	Если Основание<>Неопределено И ТипЗнч(Основание)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
		ТипЦен=обПраво("ОсновнойТипЦенПродажи",Права);
		Если ТипЦен.Рассчитывается Тогда
			ПроцентНаценки=ТипЦен.ПроцентСкидкиНаценки;
		КонецЕсли; 
		РасчетЦенОт=1;
		БазовыйТипЦен=Основание.ТипЦен;
		ЗаполнитьБазовыеЦены();
		Для Каждого СтрокаАвтомобилей Из Автомобили Цикл
			СтрокаАвтомобилей.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации",СтрокаАвтомобилей.Автомобиль,СтрокаАвтомобилей.ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			СтрокаАвтомобилей.ПроцентНаценки=?(СтрокаАвтомобилей.ЦенаБазовая=0,0,((СтрокаАвтомобилей.Цена*100)/СтрокаАвтомобилей.ЦенаБазовая)-100);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	Организация=ДилерскийЦентр.Организация;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
//	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
//	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
		Движение=Движения.Renault_СкидкиНаАвтомобили.Добавить();
		Движение.Период=Дата;
		Движение.Автомобиль=ТекСтрокаАвтомобили.Автомобиль;
		Движение.ДатаНачала=ДатаНачала;
		Движение.ДатаКонца=ДатаКонца;
		// НАЧАЛО DMSCOR-1030
		Движение.ПроцентСкидки = ТекСтрокаАвтомобили.ПроцентСкидки;
		// КОНЕЦ DMSCOR-1030 		
		Движение.СуммаСкидки=ТекСтрокаАвтомобили.СуммаСкидки;
		Движение.ВариантКомплектации=ТекСтрокаАвтомобили.ВариантКомплектации;   
		Движение.ДилерскийЦентр=ДилерскийЦентр;
		Движение.ТипСкидки=ТипСкидки;
		//Движение.ТолькоВНаличии = ТолькоВНаличии;
		//Движение.BIR = Организация.НомерДилерскогоДоговораПеречисление;
		Движение.СтатусАвтомобиля=ТекСтрокаАвтомобили.СтатусАвтомобиля;
		Движение.ГодВыпуска=ГодВыпуска;
		Движение.КоличествоДнейНаСкладе=КоличествоДнейНаСкладе;
		//Андрианова Начало 11.10.2016
		Движение.НаличиеПТС = ТекСтрокаАвтомобили.НаличиеПТС;
		Движение.ОтсутствиеКлиента = ТекСтрокаАвтомобили.ОтсутствиеКлиента;
		//Андрианова Начало 11.10.2016
	КонецЦикла;

КонецПроцедуры 

Процедура ДвижениеПоРегиструСведенийAOC_Комплектации()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль КАК МодельСпр,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации КАК ВариантКомплектацииСпр,
		|	ИзменениеЦенАвтомобилейАвтомобили.Цена КАК ЦенаКлиентская,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя КАК ДвигательОбъем,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.МощностьКВТ КАК Двигатель_кВт,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.ТипДвигателя.СтандартЕвро КАК Двигатель_НормаЕвро,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.МассаСнаряженного КАК МассаMax,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.МаксимальноДопустимая КАК МассаMin,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Родитель.Наименование КАК Гамма,
		|	ИзменениеЦенАвтомобилейАвтомобили.Ссылка.ТипЦен.Наименование КАК НаименованиеТарифа,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Артикул + "" "" + ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.Артикул КАК Тариф,
		|	ИзменениеЦенАвтомобилейАвтомобили.Автомобиль.Артикул КАК КодМодели,
		|	ИзменениеЦенАвтомобилейАвтомобили.ВариантКомплектации.Артикул КАК КодКомплектации
		|ИЗ
		|	Документ.ИзменениеЦенАвтомобилей.Автомобили КАК ИзменениеЦенАвтомобилейАвтомобили
		|ГДЕ
		|	ИзменениеЦенАвтомобилейАвтомобили.Ссылка.Ссылка = &Ссылка
		|	И ИзменениеЦенАвтомобилейАвтомобили.Автомобиль ССЫЛКА Справочник.Модели
		|	И ИзменениеЦенАвтомобилейАвтомобили.Ссылка.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.AOC_Комплектации.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
		Движение.Идентификатор = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	//Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
	//	Если ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи И ТекСтро Тогда
	//		Движение = Движения.AOC_Комплектации.Добавить();
	//		Движение.Период = Дата;
	//		Движение.КодМодели = ТекСтрокаАвтомобили.Автомоби.Артикул
	//		Движение.КодКомплектации = ТекСтрокаАвтомобили.ВариантКомплектации.Артикул;
	//		Движение.МодельСпр = ТекСтрокаАвтомобили.Автомобиль.Модель;
	//		Движение.ВариантКомплектацииСпр = ТекСтрокаАвтомобили.ВариантКомплектации;
	//		Движение.ЦенаКлиентская = ТекСтрокаАвтомобили.Цена;
	//	КонецЕсли;
	//	//Движение.ЦенаДилерская = ТекСтрокаАвтомобили.ЦенаБазовая;
	//КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
ФормаОткрыта=Ложь; //Добавил Шульц
